AilurusFulgenss/iot-internship/week-02-esp32-basic/liv24-pio/src/main.cpp
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_log.h"
#include "esp_heap_caps.h"
#include "esp_netif.h"
#include "esp_event.h"
#include "driver/gpio.h"
#include "driver/uart.h"
#include "bsp/esp32_p4_wifi6_touch_lcd_4b.h"
#include "lvgl.h"
#include "draw/lv_image_decoder_private.h"
#include "draw/lv_draw_buf_private.h"
#include "btn_mode.h"
#include "ui_user.h"
#include "ui_dev.h"
#include "ui_exec.h"
#include "ui_exec_detail.h"
#include "ui_pm.h"
#include "calib.h"
#include "eth_upload.h"
#include "wifi_mqtt.h"
#include "history.h"
#include "ui_alert.h"
#include "ui_home.h"
#include "ui_pin.h"
#include "sensor_config.h"
#include "cJSON.h"
#include <math.h>

static const char *TAG = "LIV24";

#define BOOT_BTN    GPIO_NUM_35
#define RELAY1_GPIO GPIO_NUM_32
#define RELAY2_GPIO GPIO_NUM_46
// ── RS485 / MODBUS ─────────────────────────────────────
#define RS485_TXD      GPIO_NUM_47
#define RS485_RXD      GPIO_NUM_48
#define RS485_UART     UART_NUM_1
#define MODBUS_BAUD    9600
#define MODBUS_TIMEOUT pdMS_TO_TICKS(300)

static const gpio_num_t RELAY_GPIO[2] = {RELAY1_GPIO, RELAY2_GPIO};

static lv_obj_t *scr[3];          // scr[0]=splash, scr[2]=relay
static lv_obj_t *scr_eth_setup = NULL;

// Relay state
static bool relay_on[2] = {false, false};
static lv_obj_t *relay_btn[2];
static lv_obj_t *relay_btn_lbl[2];

// ─── helpers ───────────────────────────────────────────

static lv_obj_t *make_hline(lv_obj_t *parent, int y, int w = 560)
{
    lv_obj_t *line = lv_obj_create(parent);
    lv_obj_set_size(line, w, 2);
    lv_obj_set_style_bg_color(line, lv_color_hex(0x00E5FF), 0);
    lv_obj_set_style_border_width(line, 0, 0);
    lv_obj_set_style_pad_all(line, 0, 0);
    lv_obj_align(line, LV_ALIGN_TOP_MID, 0, y);
    return line;
}

static lv_obj_t *make_label(lv_obj_t *parent, const char *text,
                             uint32_t color, const lv_font_t *font,
                             lv_align_t align, int x, int y)
{
    lv_obj_t *lbl = lv_label_create(parent);
    lv_label_set_text(lbl, text);
    lv_obj_set_style_text_color(lbl, lv_color_hex(color), 0);
    lv_obj_set_style_text_font(lbl, font, 0);
    lv_obj_align(lbl, align, x, y);
    return lbl;
}

// ─── Page 1: Splash ────────────────────────────────────
// Shows logo image (centered) if logo.png is on SPIFFS; otherwise falls back to text.

static void create_splash(void)
{
    scr[0] = lv_obj_create(NULL);
    lv_obj_set_style_bg_color(scr[0], lv_color_hex(0x080808), 0);
    lv_obj_set_style_bg_opa(scr[0], LV_OPA_COVER, 0);
    lv_obj_set_style_pad_all(scr[0], 0, 0);

    if (eth_upload_has_logo()) {
        lv_obj_t *logo = lv_image_create(scr[0]);
        lv_image_set_src(logo, ETH_LOGO_HD_LVGL_PATH);
        lv_obj_align(logo, LV_ALIGN_CENTER, 0, -60);

        make_label(scr[0], "LIV-24",   0x00E5FF, &lv_font_montserrat_32,
                   LV_ALIGN_CENTER, 0,  80);
        make_label(scr[0], "IoT NODE", 0x334455, &lv_font_montserrat_14,
                   LV_ALIGN_CENTER, 0, 120);
    } else {
        make_label(scr[0], "LIV-24",   0x00ff44, &lv_font_montserrat_48,
                   LV_ALIGN_CENTER, 0, -120);
        make_label(scr[0], "IoT NODE", 0xffffff, &lv_font_montserrat_32,
                   LV_ALIGN_CENTER, 0,  -40);
        make_hline(scr[0], 340);
        make_label(scr[0], "Waveshare ESP32-P4",   0x555555, &lv_font_montserrat_14,
                   LV_ALIGN_CENTER, 0,  70);
        make_label(scr[0], "Device ID: ESP32-001", 0x777777, &lv_font_montserrat_14,
                   LV_ALIGN_CENTER, 0, 100);
        make_label(scr[0], "[ BOOT ]  next page  >", 0x335533, &lv_font_montserrat_14,
                   LV_ALIGN_BOTTOM_MID, 0, -30);
    }
}

// ─── Ethernet Setup screen ─────────────────────────────
// Shown when no logo found — prompts user to plug in Ethernet and browse to device IP.

static lv_obj_t *create_eth_setup_screen(lv_obj_t **out_qr, lv_obj_t **out_ip_label)
{
    scr_eth_setup = lv_obj_create(NULL);
    lv_obj_set_style_bg_color(scr_eth_setup, lv_color_hex(0x0A0A12), 0);
    lv_obj_set_style_bg_opa(scr_eth_setup, LV_OPA_COVER, 0);
    lv_obj_set_style_pad_all(scr_eth_setup, 0, 0);

    // Top bar
    lv_obj_t *bar = lv_obj_create(scr_eth_setup);
    lv_obj_set_size(bar, 720, 6);
    lv_obj_align(bar, LV_ALIGN_TOP_MID, 0, 0);
    lv_obj_set_style_bg_color(bar, lv_color_hex(0x00E5FF), 0);
    lv_obj_set_style_border_width(bar, 0, 0);
    lv_obj_set_style_pad_all(bar, 0, 0);

    make_label(scr_eth_setup, "SETUP MODE",
               0x00E5FF, &lv_font_montserrat_32, LV_ALIGN_TOP_MID, 0, 26);

    // Divider between columns
    lv_obj_t *div = lv_obj_create(scr_eth_setup);
    lv_obj_set_size(div, 2, 520);
    lv_obj_set_pos(div, 359, 100);
    lv_obj_set_style_bg_color(div, lv_color_hex(0x1A2A3A), 0);
    lv_obj_set_style_border_width(div, 0, 0);
    lv_obj_set_style_pad_all(div, 0, 0);

    // ── Left column: Logo upload ──────────────────────────────────────
    make_label(scr_eth_setup, "LOGO UPLOAD",
               0x445566, &lv_font_montserrat_14, LV_ALIGN_TOP_MID, -180, 95);

    lv_obj_t *qr = lv_qrcode_create(scr_eth_setup);
    lv_qrcode_set_size(qr, 200);
    lv_qrcode_set_dark_color(qr, lv_color_hex(0x00E5FF));
    lv_qrcode_set_light_color(qr, lv_color_hex(0x0A0A12));
    lv_obj_align(qr, LV_ALIGN_CENTER, -170, -20);
    lv_obj_add_flag(qr, LV_OBJ_FLAG_HIDDEN);
    *out_qr = qr;

    lv_obj_t *ip_lbl = lv_label_create(scr_eth_setup);
    lv_label_set_text(ip_lbl, "Waiting for IP...");
    lv_obj_set_style_text_color(ip_lbl, lv_color_hex(0xFFAA00), 0);
    lv_obj_set_style_text_font(ip_lbl, &lv_font_montserrat_14, 0);
    lv_obj_align(ip_lbl, LV_ALIGN_CENTER, -170, 120);
    *out_ip_label = ip_lbl;

    make_label(scr_eth_setup, "Plug in Ethernet\nthen scan to upload logo",
               0x334455, &lv_font_montserrat_14, LV_ALIGN_BOTTOM_MID, -180, -20);

    // ── Right column: Telegram add bot ───────────────────────────────
    make_label(scr_eth_setup, "ADD TELEGRAM BOT",
               0x1565C0, &lv_font_montserrat_14, LV_ALIGN_TOP_MID, 180, 95);

    lv_obj_t *tg_qr = lv_qrcode_create(scr_eth_setup);
    lv_qrcode_set_size(tg_qr, 200);
    lv_qrcode_set_dark_color(tg_qr, lv_color_hex(0x2CA5E0));
    lv_qrcode_set_light_color(tg_qr, lv_color_hex(0x0A0A12));
    lv_obj_align(tg_qr, LV_ALIGN_CENTER, 170, -20);
    const char *tg_url = "https://t.me/liv24alert_bot";
    lv_qrcode_update(tg_qr, tg_url, strlen(tg_url));

    make_label(scr_eth_setup, "@liv24alert_bot",
               0x2CA5E0, &lv_font_montserrat_14, LV_ALIGN_CENTER, 170, 120);

    make_label(scr_eth_setup, "Scan to receive alerts\nvia Telegram",
               0x0D3B5E, &lv_font_montserrat_14, LV_ALIGN_BOTTOM_MID, 180, -20);

    return scr_eth_setup;
}

// ─── Page 2: Relay Control ─────────────────────────────
// Styled header bar (72px) matching USER/PM screens.
// Relay buttons shifted +72px down from previous layout.

// Called from both button tap and MQTT — safe from any task via bsp_display_lock.
void relay_set_state(int idx, bool on)
{
    if (idx < 0 || idx > 1) return;
    relay_on[idx] = on;
    gpio_set_level(RELAY_GPIO[idx], on ? 1 : 0);
    ESP_LOGI(TAG, "Relay %d -> %s (GPIO%d=%d)",
             idx + 1, on ? "ON" : "OFF", RELAY_GPIO[idx], on ? 1 : 0);

