AilurusFulgenss/iot-internship/week-02-esp32-basic/liv24-pio/src/main.cpp
    if (bsp_display_lock(0)) {
        lv_label_set_text(relay_btn_lbl[idx], on ? "ON" : "OFF");
        lv_obj_set_style_bg_color(relay_btn[idx],
            on ? lv_color_hex(0x00E5FF) : lv_color_hex(0x222222), 0);
        lv_obj_set_style_text_color(relay_btn_lbl[idx],
            on ? lv_color_hex(0xFFFFFF) : lv_color_hex(0x555555), 0);
        bsp_display_unlock();
    }
    wifi_mqtt_publish_relay_state(idx, on);
}

static void relay_cb(lv_event_t *e)
{
    int idx = (int)(intptr_t)lv_event_get_user_data(e);
    relay_set_state(idx, !relay_on[idx]);
}

static void create_relay_ctrl(void)
{
    scr[2] = lv_obj_create(NULL);
    lv_obj_set_style_bg_color(scr[2], lv_color_hex(0x0A0A12), 0);
    lv_obj_set_style_bg_opa(scr[2], LV_OPA_COVER, 0);
    lv_obj_set_style_pad_all(scr[2], 0, 0);

    // ── Header bar (72px) — same style as USER/PM screens ──
    lv_obj_t *hdr = lv_obj_create(scr[2]);
    lv_obj_set_size(hdr, 720, 72);
    lv_obj_align(hdr, LV_ALIGN_TOP_MID, 0, 0);
    lv_obj_set_style_bg_color(hdr, lv_color_hex(0x12121E), 0);
    lv_obj_set_style_bg_opa(hdr, LV_OPA_COVER, 0);
    lv_obj_set_style_radius(hdr, 0, 0);
    lv_obj_set_style_border_width(hdr, 0, 0);
    lv_obj_set_style_pad_hor(hdr, 22, 0);
    lv_obj_clear_flag(hdr, LV_OBJ_FLAG_SCROLLABLE);

    lv_obj_t *accent = lv_obj_create(hdr);
    lv_obj_set_size(accent, 720, 3);
    lv_obj_align(accent, LV_ALIGN_TOP_MID, 0, 48);
    lv_obj_set_style_bg_color(accent, lv_color_hex(0x00E5FF), 0);
    lv_obj_set_style_border_width(accent, 0, 0);
    lv_obj_set_style_pad_all(accent, 0, 0);

    // Logo (left side, if available) — user-uploaded PNG
    int title_x = 0;
    if (eth_upload_has_logo()) {
        lv_obj_t *logo_img = lv_image_create(hdr);
        lv_image_set_src(logo_img, ETH_LOGO_LVGL_PATH);
        lv_obj_set_size(logo_img, 48, 48);
        lv_obj_align(logo_img, LV_ALIGN_LEFT_MID, 0, 0);
        title_x = 58;
    }

    lv_obj_t *lbl_title = lv_label_create(hdr);
    lv_label_set_text(lbl_title, "RELAY CONTROL");
    lv_obj_set_style_text_color(lbl_title, lv_color_hex(0x00E5FF), 0);
    lv_obj_set_style_text_font(lbl_title, &lv_font_montserrat_32, 0);
    lv_obj_align(lbl_title, LV_ALIGN_LEFT_MID, title_x, 0);

    // ── Relay buttons — shifted +72px for header ──────────
    // Button 1: y=252 (was 180), Button 2: y=492 (was 420)
    // Button 2 bottom: 492+140=632, margin to screen bottom: 88px ✓
    const char *names[] = {"RELAY  1", "RELAY  2"};
    const int   ys[]    = {212, 452};  // shifted up 40px from original

    for (int i = 0; i < 2; i++) {
        make_label(scr[2], names[i], 0x888888, &lv_font_montserrat_14,
                   LV_ALIGN_TOP_MID, 0, ys[i] - 50);

        relay_btn[i] = lv_btn_create(scr[2]);
        lv_obj_set_size(relay_btn[i], 400, 140);
        lv_obj_set_style_bg_color(relay_btn[i], lv_color_hex(0x222222), 0);
        lv_obj_set_style_radius(relay_btn[i], 12, 0);
        lv_obj_set_style_border_color(relay_btn[i], lv_color_hex(0x333333), 0);
        lv_obj_set_style_border_width(relay_btn[i], 2, 0);
        lv_obj_align(relay_btn[i], LV_ALIGN_TOP_MID, 0, ys[i]);
        lv_obj_add_event_cb(relay_btn[i], relay_cb, LV_EVENT_CLICKED,
                            (void *)(intptr_t)i);

        relay_btn_lbl[i] = lv_label_create(relay_btn[i]);
        lv_label_set_text(relay_btn_lbl[i], "OFF");
        lv_obj_set_style_text_font(relay_btn_lbl[i], &lv_font_montserrat_32, 0);
        lv_obj_set_style_text_color(relay_btn_lbl[i], lv_color_hex(0x555555), 0);
        lv_obj_center(relay_btn_lbl[i]);
    }

}

// ─── RS485 / MODBUS RTU ────────────────────────────────

static uint16_t crc16(const uint8_t *buf, int len)
{
    uint16_t crc = 0xFFFF;
    for (int i = 0; i < len; i++) {
        crc ^= buf[i];
        for (int j = 0; j < 8; j++)
            crc = (crc & 1) ? (crc >> 1) ^ 0xA001 : (crc >> 1);
    }
    return crc;
}

static void rs485_init(void)
{
    uart_config_t cfg = {
        .baud_rate  = MODBUS_BAUD,
        .data_bits  = UART_DATA_8_BITS,
        .parity     = UART_PARITY_DISABLE,
        .stop_bits  = UART_STOP_BITS_1,
        .flow_ctrl  = UART_HW_FLOWCTRL_DISABLE,
        .source_clk = UART_SCLK_DEFAULT,
    };
    uart_driver_install(RS485_UART, 256, 0, 0, NULL, 0);
    uart_param_config(RS485_UART, &cfg);
    uart_set_pin(RS485_UART, RS485_TXD, RS485_RXD,
                 UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
    uart_set_mode(RS485_UART, UART_MODE_RS485_HALF_DUPLEX);
}

// REG MAP (SN-300BYH-M, all /10 except sound):
// 0x0000=Humidity*0.1%  0x0001=Temp*0.1C
// 0x0003=PM10*0.1ug/m3  0x0004=PM2.5*0.1ug/m3  0x0005=Sound dB
static bool modbus_read(uint8_t slave_id, uint8_t fc, uint16_t start_reg, uint8_t count, uint16_t *out)
{
    if (count == 0 || count > 30) return false;

    uint8_t req[8];
    req[0] = slave_id;
    req[1] = fc;
    req[2] = start_reg >> 8;
    req[3] = start_reg & 0xFF;
    req[4] = 0x00;
    req[5] = count;
    uint16_t crc = crc16(req, 6);
    req[6] = crc & 0xFF;
    req[7] = crc >> 8;

    uart_flush_input(RS485_UART);
    uart_write_bytes(RS485_UART, req, sizeof(req));

    int expected = 5 + 2 * count;
    uint8_t resp[64] = {};
    int got = uart_read_bytes(RS485_UART, resp, expected, MODBUS_TIMEOUT);
    if (got < expected) return false;

    uint16_t resp_crc = resp[got - 2] | (resp[got - 1] << 8);
    if (crc16(resp, got - 2) != resp_crc) return false;

    for (int i = 0; i < count; i++)
        out[i] = (resp[3 + i * 2] << 8) | resp[4 + i * 2];
    return true;
}

static void sensor_read_task(void *arg)
{
    uint16_t regs[32];
    char buf[16];

    while (1) {
        sensor_config_t       cfg = sensor_config_get();
        const sensor_model_t *m   = &SENSOR_MODELS[cfg.model_idx];

        if (modbus_read(cfg.slave_id, m->fc, m->reg_start, m->reg_count, regs)) {
            sensor_store_raw(regs, m->reg_count);

            switch (m->type) {
            case SENSOR_TYPE_PM: {
                float temp = (m->idx_temp  >= 0) ? (int16_t)regs[m->idx_temp]  / m->scale : NAN;
                float hum  = (m->idx_hum   >= 0) ? regs[m->idx_hum]            / m->scale : NAN;
                float pm10 = (m->idx_pm10  >= 0) ? regs[m->idx_pm10]  / m->scale : NAN;
                float pm25 = (m->idx_pm25  >= 0) ? regs[m->idx_pm25]  / m->scale : NAN;
                uint16_t snd = (m->idx_sound >= 0) ? regs[m->idx_sound] : 0;

                ESP_LOGI(TAG, "T=%.1fC H=%.1f%% Sound=%ddB PM2.5=%.1f PM10=%.1f",
                         temp, hum, snd, pm25, pm10);

                float t_cal   = calib_apply(temp,       &g_calib.temp);
                float h_cal   = calib_apply(hum,        &g_calib.hum);
                float p25_cal = calib_apply(pm25,       &g_calib.pm25);
                float p10_cal = calib_apply(pm10,       &g_calib.pm10);
                float s_cal   = calib_apply((float)snd, &g_calib.sound);

                bsp_display_lock(0);
                ui_alert_set_mqtt_status(wifi_mqtt_is_connected());
                ui_user_update(t_cal, h_cal, p25_cal, p10_cal, (int)s_cal);
                ui_pm_update(t_cal, h_cal, p25_cal, p10_cal, (float)s_cal);
                ui_dev_update_sn300(temp, hum, (float)snd, pm25, pm10);
                ui_exec_update_pm(t_cal, h_cal, p25_cal, p10_cal);
                ui_home_update_sensors(p25_cal, t_cal, h_cal);
                ui_alert_check(t_cal, h_cal, p25_cal, p10_cal, s_cal);
                bsp_display_unlock();

                wifi_mqtt_publish_sensors(t_cal, h_cal, (int)s_cal, p25_cal, p10_cal);
                break;
            }
            default:
                ESP_LOGW(TAG, "sensor: unsupported type %d", m->type);
                break;
            }
        } else {
            ESP_LOGW(TAG, "sensor: no response");
        }
        vTaskDelay(pdMS_TO_TICKS(2000));
    }
}

// ─── Touch navigation: replaces BOOT button (GPIO35 = EMAC TXD1 conflict) ────

static void touch_nav_init(void)
{
    // ── ▶ next-page button at bottom-right of USER-mode screens ──────────────
    // Strip on PM screen moved up to -72 (from -48), so ▶ at -8 clears it with 8px gap.
    lv_obj_t *cycle_scrns[] = {scr_user, scr_pm, scr[2]};
    int       cycle_y[]     = {-8, -8, -8};
    for (int i = 0; i < 3; i++) {
        lv_obj_t *btn = lv_btn_create(cycle_scrns[i]);
        lv_obj_set_size(btn, 88, 56);
        lv_obj_align(btn, LV_ALIGN_BOTTOM_RIGHT, -8, cycle_y[i]);
        lv_obj_set_style_bg_color(btn, lv_color_hex(0x00E5FF), 0);
        lv_obj_set_style_bg_opa(btn, LV_OPA_10, 0);
        lv_obj_set_style_border_color(btn, lv_color_hex(0x00E5FF), 0);
        lv_obj_set_style_border_width(btn, 1, 0);
        lv_obj_set_style_border_opa(btn, LV_OPA_30, 0);
        lv_obj_set_style_radius(btn, 6, 0);
        lv_obj_set_style_shadow_width(btn, 0, 0);
        lv_obj_add_event_cb(btn, [](lv_event_t *) { on_short_press(); },
                            LV_EVENT_CLICKED, NULL);
        lv_obj_t *lbl = lv_label_create(btn);
        lv_label_set_text(lbl, LV_SYMBOL_RIGHT);
        lv_obj_set_style_text_color(lbl, lv_color_hex(0x00E5FF), 0);
        lv_obj_set_style_text_font(lbl, &lv_font_montserrat_24, 0);
        lv_obj_center(lbl);
    }

