AilurusFulgenss/iot-internship/week-02-esp32-basic/liv24-pio/src/main.cpp
    // ── DEV / EXEC hidden zones — 5-tap on top corners, no visible UI ───────
    // top-left   × 5  → DEV (calibrate)
    // top-center × 5  → EXEC (overview)
    {
        struct TapZone { uint32_t t[5]; int n; app_mode_t mode; };
        static TapZone tz_dev  = {{}, 0, MODE_DEV};
        static TapZone tz_exec = {{}, 0, MODE_EXEC};

        auto tap_cb = [](lv_event_t *e) {
            auto *tz     = static_cast<TapZone *>(lv_event_get_user_data(e));
            uint32_t now = lv_tick_get();
            if (tz->n > 0 && lv_tick_elaps(tz->t[tz->n - 1]) > 600)
                tz->n = 0;
            if (tz->n < 5) tz->t[tz->n] = now;
            tz->n++;
            if (tz->n >= 5) {
                if (lv_tick_elaps(tz->t[0]) <= 3000) {
                    if (tz->mode == MODE_DEV)
                        ui_pin_show([]() { set_app_mode(MODE_DEV); });
                    else
                        set_app_mode(tz->mode);
                }
                tz->n = 0;
            }
        };

        TapZone *zones[2]    = {&tz_dev, &tz_exec};
        lv_align_t aligns[2] = {LV_ALIGN_TOP_LEFT, LV_ALIGN_TOP_MID};
        int x_off[2]         = {0, 0};
        int y_off[2]         = {0, 0};
        for (int i = 0; i < 2; i++) {
            lv_obj_t *z = lv_obj_create(scr_user);
            lv_obj_set_size(z, 90, 90);
            lv_obj_align(z, aligns[i], x_off[i], y_off[i]);
            lv_obj_set_style_bg_opa(z, LV_OPA_TRANSP, 0);
            lv_obj_set_style_border_width(z, 0, 0);
            lv_obj_set_style_shadow_width(z, 0, 0);
            lv_obj_add_flag(z, LV_OBJ_FLAG_CLICKABLE);
            lv_obj_clear_flag(z, LV_OBJ_FLAG_SCROLLABLE);
            lv_obj_add_event_cb(z, tap_cb, LV_EVENT_CLICKED, zones[i]);
        }
    }

    // ── ← USER exit button on DEV and EXEC screens ───────────────────────────
    lv_obj_t *mode_scrns[] = {scr_dev, scr_exec};
    for (int i = 0; i < 2; i++) {
        lv_obj_t *btn = lv_btn_create(mode_scrns[i]);
        lv_obj_set_size(btn, 88, 40);
        lv_obj_align(btn, LV_ALIGN_TOP_RIGHT, -8, 12);
        lv_obj_set_style_bg_color(btn, lv_color_hex(0x1A1A2E), 0);
        lv_obj_set_style_bg_opa(btn, LV_OPA_COVER, 0);
        lv_obj_set_style_border_color(btn, lv_color_hex(0x2C3D52), 0);
        lv_obj_set_style_border_width(btn, 1, 0);
        lv_obj_set_style_radius(btn, 6, 0);
        lv_obj_set_style_shadow_width(btn, 0, 0);
        lv_obj_add_event_cb(btn, [](lv_event_t *) { set_app_mode(MODE_USER); },
                            LV_EVENT_CLICKED, NULL);
        lv_obj_t *lbl = lv_label_create(btn);
        lv_label_set_text(lbl, LV_SYMBOL_LEFT " USER");
        lv_obj_set_style_text_color(lbl, lv_color_hex(0x445566), 0);
        lv_obj_set_style_text_font(lbl, &lv_font_montserrat_14, 0);
        lv_obj_center(lbl);
    }
}

// ─── btn_mode callbacks ────────────────────────────────

// Short press cycle: USER → PM History → Relay → USER
void on_short_press(void)
{
    bsp_display_lock(0);
    lv_obj_t *active = lv_scr_act();
    if (active == scr_exec) {
        // EXEC mode — short press does nothing
    } else if (active == scr_home) {
        // Home has no nav button — do nothing
    } else if (active == scr_user) {
        lv_scr_load_anim(scr_pm, LV_SCR_LOAD_ANIM_MOVE_LEFT, 300, 0, false);
        ESP_LOGI(TAG, "-> PM History");
    } else if (active == scr_pm) {
        lv_scr_load_anim(scr[2], LV_SCR_LOAD_ANIM_MOVE_LEFT, 300, 0, false);
        ESP_LOGI(TAG, "-> Relay page");
    } else {
        lv_scr_load_anim(scr_home, LV_SCR_LOAD_ANIM_MOVE_RIGHT, 300, 0, false);
        ESP_LOGI(TAG, "-> Home");
    }
    bsp_display_unlock();
}

void on_mode_changed(app_mode_t new_mode)
{
    bsp_display_lock(0);
    switch (new_mode) {
        case MODE_USER:
            lv_scr_load_anim(scr_user, LV_SCR_LOAD_ANIM_FADE_IN, 400, 0, false);
            break;
        case MODE_DEV:
            lv_scr_load_anim(scr_dev,  LV_SCR_LOAD_ANIM_MOVE_LEFT, 400, 0, false);
            break;
        case MODE_EXEC:
            lv_scr_load_anim(scr_exec, LV_SCR_LOAD_ANIM_NONE, 0, 0, false);
            break;
    }
    bsp_display_unlock();
}

// ─── app_main ──────────────────────────────────────────

static void on_test_alert(const char *json, int len)
{
    char buf[128];
    int  n = len < (int)sizeof(buf) - 1 ? len : (int)sizeof(buf) - 1;
    memcpy(buf, json, n); buf[n] = '\0';

    cJSON *root = cJSON_Parse(buf);
    if (!root) return;

    float temp  = cJSON_IsNumber(cJSON_GetObjectItem(root, "temp"))  ? (float)cJSON_GetObjectItem(root, "temp")->valuedouble  : NAN;
    float hum   = cJSON_IsNumber(cJSON_GetObjectItem(root, "hum"))   ? (float)cJSON_GetObjectItem(root, "hum")->valuedouble   : NAN;
    float pm25  = cJSON_IsNumber(cJSON_GetObjectItem(root, "pm25"))  ? (float)cJSON_GetObjectItem(root, "pm25")->valuedouble  : NAN;
    float pm10  = cJSON_IsNumber(cJSON_GetObjectItem(root, "pm10"))  ? (float)cJSON_GetObjectItem(root, "pm10")->valuedouble  : NAN;
    float sound = cJSON_IsNumber(cJSON_GetObjectItem(root, "sound")) ? (float)cJSON_GetObjectItem(root, "sound")->valuedouble : NAN;
    cJSON_Delete(root);

    if (bsp_display_lock(0)) {
        ui_alert_check(temp, hum, pm25, pm10, sound);
        bsp_display_unlock();
    }

    // Auto-dismiss after 15 s — prevents retained broker messages from
    // leaving a permanent banner when no PM sensor is connected to clear it.
    xTaskCreate([](void *) {
        vTaskDelay(pdMS_TO_TICKS(15000));
        if (bsp_display_lock(0)) {
            ui_alert_check(NAN, NAN, NAN, NAN, NAN);
            bsp_display_unlock();
        }
        vTaskDelete(NULL);
    }, "alert_clr", 2048, NULL, 2, NULL);
}

static void on_hist_24h(const char *d, int len)
{
    hist_parse_24h(d, len);
    if (bsp_display_lock(0)) {
        ui_pm_refresh_history();
        bsp_display_unlock();
    }
}

static void on_hist_7d(const char *d, int len)
{
    hist_parse_7d(d, len);
    if (bsp_display_lock(0)) {
        ui_exec_detail_refresh();
        bsp_display_unlock();
    }
}

static void logo_url_received(const char *url)
{
    ESP_LOGI(TAG, "Logo URL: %s", url);
    char *url_copy = strdup(url);
    xTaskCreate([](void *arg) {
        const char *u = (const char *)arg;
        if (eth_logo_fetch_from_url(u)) {
            vTaskDelay(pdMS_TO_TICKS(300));
            esp_restart();
        } else {
            ESP_LOGE(TAG, "Logo fetch failed");
        }
        free((void *)u);
        vTaskDelete(NULL);
    }, "logo_fetch", 8192, url_copy, 3, NULL);
}

