AilurusFulgenss/iot-internship/week-02-esp32-basic/liv24-pio/src/main.cpp
extern "C" void app_main(void)
{
    ESP_LOGI(TAG, "LIV-24 starting...");

    // Init network stack once, at the very top — both eth_start_background()
    // and eth_upload_start() rely on these being called exactly once before use.
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());

    sensor_config_init();
    calib_init();
    rs485_init();

    // Relay GPIO init — default OFF
    gpio_config_t relay_cfg = {};
    relay_cfg.pin_bit_mask = (1ULL << RELAY1_GPIO) | (1ULL << RELAY2_GPIO);
    relay_cfg.mode         = GPIO_MODE_OUTPUT;
    relay_cfg.pull_down_en = GPIO_PULLDOWN_DISABLE;
    relay_cfg.pull_up_en   = GPIO_PULLUP_DISABLE;
    relay_cfg.intr_type    = GPIO_INTR_DISABLE;
    gpio_config(&relay_cfg);
    gpio_set_level(RELAY1_GPIO, 0);
    gpio_set_level(RELAY2_GPIO, 0);

    // ── Boot-hold reset: hold BOOT button at power-on → clears logo → setup mode ──
    gpio_set_direction(BOOT_BTN, GPIO_MODE_INPUT);
    gpio_set_pull_mode(BOOT_BTN, GPIO_PULLUP_ONLY);
    vTaskDelay(pdMS_TO_TICKS(150));
    if (gpio_get_level(BOOT_BTN) == 0) {
        eth_upload_clear_logo();
        ESP_LOGW(TAG, "Boot-hold: restarting into setup mode");
        esp_restart();
    }

    {
        bsp_display_cfg_t disp_cfg = {
            .lvgl_port_cfg = ESP_LVGL_PORT_INIT_CONFIG(),
            .buffer_size   = BSP_LCD_DRAW_BUFF_SIZE,
            .double_buffer = BSP_LCD_DRAW_BUFF_DOUBLE,
            .flags = {
                .buff_dma    = true,
                .buff_spiram = false,
                .sw_rotate   = true,
            },
        };
        disp_cfg.lvgl_port_cfg.task_stack = 16384;
        bsp_display_start_with_config(&disp_cfg);
    }
    // Kconfig LV_MEM_POOL_EXPAND_SIZE_KILOBYTES only relaxes TLSF size limit —
    // the extra PSRAM pool must be registered explicitly via lv_mem_add_pool().
    static void *s_lvgl_psram_pool = heap_caps_malloc(256 * 1024, MALLOC_CAP_SPIRAM);
    if (s_lvgl_psram_pool) {
        bsp_display_lock(0);
        lv_mem_add_pool(s_lvgl_psram_pool, 256 * 1024);
        bsp_display_unlock();
        ESP_LOGI(TAG, "LVGL PSRAM pool: 256KB @%p", s_lvgl_psram_pool);
    }
    bsp_display_backlight_on();

    // Initialize LVGL POSIX filesystem driver (maps drive 'A' → /spiffs)
    // Must be called after bsp_display_start() initializes LVGL.
    lv_fs_posix_init();
    lv_tjpgd_init();

    // Mount SPIFFS and check if logo.jpg exists
    eth_upload_init();

    // Sensor task created HERE — after bsp_display_start() — so bsp_display_lock()
    // is never called before lvgl_port_init (would assert-fail in esp_lvgl_port).
    xTaskCreate(sensor_read_task, "sensor", 4096, NULL, 5, NULL);

    if (!eth_upload_has_logo()) {
        lv_obj_t *qr_obj, *ip_label;
        bsp_display_lock(0);
        create_eth_setup_screen(&qr_obj, &ip_label);
        lv_scr_load(scr_eth_setup);
        bsp_display_unlock();
        eth_upload_start(qr_obj, ip_label);
        return;
    }

    // ── Normal boot: logo exists ─────────────────────────────
    // One lock block: create ALL screens + load splash first.
    // taskLVGL blocked for entire duration → no dirty PSRAM L2 cache lines
    // at unlock → avoids ESP32-P4 Rev 1.3 ROM deadlock.
    bsp_display_lock(0);
    create_splash();          // shows logo centered on dark bg
    create_relay_ctrl();
    ui_user_create();
    ui_pm_create();
    ui_dev_create();
    ui_exec_create();
    ui_exec_detail_create();
    ui_home_create();
    touch_nav_init();
    ui_alert_init();
    ui_home_set_card1_cb([]() {
        lv_scr_load_anim(scr_user, LV_SCR_LOAD_ANIM_MOVE_LEFT, 300, 0, false);
    });
    lv_scr_load(scr[0]);     // show logo splash — inside the same lock block
    bsp_display_unlock();

    // Hold logo splash for 2.5s, then fade into USER screen
    vTaskDelay(pdMS_TO_TICKS(2500));

    bsp_display_lock(0);
    lv_scr_load_anim(scr_home, LV_SCR_LOAD_ANIM_FADE_IN, 600, 0, false);
    bsp_display_unlock();

    // Register MQTT handler BEFORE starting Ethernet — esp_eth_start() blocks
    // during PHY autonegotiation; DHCP can complete during that block so the
    // IP_EVENT_ETH_GOT_IP handler must already be registered when it fires.
    wifi_mqtt_set_relay_cb(relay_set_state);
    wifi_mqtt_set_logo_url_cb(logo_url_received);
    wifi_mqtt_set_history_cb(on_hist_24h, on_hist_7d);
    wifi_mqtt_set_test_alert_cb(on_test_alert);
    wifi_mqtt_set_ip_cb([](const char *ip) {
        if (bsp_display_lock(0)) {
            ui_dev_update_network(ip);
            bsp_display_unlock();
        }
    });
    wifi_mqtt_init(MQTT_BROKER_URI);
    eth_start_background();

    // btn_mode_init(BOOT_BTN);
    // GPIO35 = EMAC RMII TXD1. gpio_config(INPUT) from btn_mode_init clears the
    // GPIO matrix output-enable on GPIO35, disabling TXD1 and corrupting all
    // Ethernet TX frames. Button disabled until a non-EMAC GPIO is identified.
}
